"""Цикл
Создать список из десяти целых чисел.
Вывести на экран каждое число, увеличенное на 1."""



figures=[1,2,3,4,5,6,7,8,9,10]

for figure in figures:
  print(figure +1 )
   
"""Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли."""


string=input("Введите строку:")
for letter in string:
  print(letter)